In [1]:
import pandas as pd 
import numpy as np

In [4]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## selecting unique values of DataFrame

In [8]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

## '.nunique' method gives count of unique record in a columns

Check Below:---->>>

In [9]:
df['col2'].nunique()

3

## 'value_count' method gives count of record which record has occured how many times in a row 

Check Below :--->>>

In [14]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df[(df['col1']>2) & (df['col2']>500)]

   col1  col2 col3
2     3   666  ghi

## applying user defined functions on a column of DataFrame

Check Below :--->>>

In [20]:
def times2(x):
    return x*2

In [21]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

## Applying builtin functions on a column of DataFrame

check Below :-->>>

Applying 'len' function on col3 to take the lenght of all string record

In [22]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Applying 'lambda' functions on column

Check Below:---->>>>

In [23]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

## removing a column from DataFrame

df.drop('col2',axis=1)

## ".drop()" Method doesn't occur inplace bydefault
we need to mention $ inplace=True$ to make it occur inplace

In [24]:
df.drop('col2',axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
type(df.columns)

pandas.core.indexes.base.Index

In [32]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
type(df.index)

pandas.core.indexes.range.RangeIndex

## "sort_values" Method
## Sorting DataFrame by a column

Check Below :-->>>

In [35]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [40]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## ".isnull" Method 

To check null values in dataFrame 

Check Below :-->>>

In [41]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [42]:
type(df.isnull())

pandas.core.frame.DataFrame

## pivot Table function in DataFrame

" df.pivot_table $"

In [49]:
df=pd.DataFrame({'A':['woo','woo','woo','bar','bar','bar'],
                'B':['one','one','two','two','one','one'],
                 'C':['x','y','x','y','x','y'],
                'D':[1,3,2,5,4,1]})

In [50]:
df

     A    B  C  D
0  woo  one  x  1
1  woo  one  y  3
2  woo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
woo one  1.0  3.0
    two  2.0  NaN

In [52]:
pwd

'C:\\Users\\ckp43_000\\Py_DS_CKP\\Python_DataScience\\Pandas'